<?php
     session_start();
     include('server.php');
 
?>

<!DOCTYPE html>
<html lang="en">
<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>BMI</title>
    <link rel="stylesheet" href="nav-style.css">

    <style>
        body{
          background: url("img/bg-bmi.png") no-repeat center fixed; 
          background-size: cover;
          font-family: "Times New Roman", Times, serif;
        }
        h1{
            margin: 20px 0 0 630px;
            font-size: 60px;
            color: rgb(255, 133, 3);
        }
        .calculat-bmi{
            font-size: 25px;
            margin: 50px 0 0 200px;
            color: white;
        }
        
        #weight, #height{
            color: white;
            padding: 12px 20px;
            width: 250px;
            margin: 20px 0;
            border: none;
            border-bottom: 2px solid rgb(255, 133, 3);
            background-color: black;
        }
        #sub-bmi{
            margin: 20px 0 0 80px;
            width: 120px;
            height: 30px;
            font-size: 20px;
            border-radius: 5px;
            background-color: rgb(255, 133, 3);
        }
        #output-bmi{
            width: 300px;
            height: 150px;
            margin: 40px 0 0 0;
            padding: 2px auto 10px auto;
            background-color: white;
            border-width: 5px;
            border-color: rgb(255, 133, 3);
        }
        #ob{
            font-size: 25px;
            font-weight: bolder;
            text-shadow: 1px 1px rgb(255, 133, 3);
        }
        #obmi{
            font-size: 60px;
        }
        .show-bmi{
            position: absolute;
            top: 70px;
            right: 50px;
            width: 650px;
            height: 650px;
            background-color: white;
        }
        table, td, th {
            text-align: center;
            padding: 5px 10px;
            width: 650px;
            border: 3px solid rgb(255, 133, 3);
            border-collapse: collapse;
        }
        #para{
            padding: 0 20px;
        }
        #aback {
            position:absolute;
            top: 90%;
            right: 40px;
            width: 50px;
            height: 30px;
            padding: 10px 25px;
            border-radius: 10px;
            background-color: rgb(248, 180, 54);
            font-size: 25px;
            font-weight: bolder;
            color: white;
            text-decoration: none;
        }

    </style>
</head>
<body>
<a href="index.php"><img src="img/logo.png" id="logo-img" ></a>
    <div class="nav-menu">
        <a href="profile.php">PROFILE</a>
        <div class="dropdown">
        <button class="dropbtn">CALORIE</button>
        <div class="dropdown-content">
            <a href="calorie-menu/batmintan.php" >แบตมินตัน</a>
            <a href="calorie-menu/run.php" >วิ่ง</a>
            <a href="calorie-menu/bike.php" >ปั่นจักรยาน</a>
            <a href="calorie-menu/body.php" >บอดี้เวท</a>
            <a href="calorie-menu/jamp.php" >กระโดดเชือก</a>
            <a href="calorie-menu/walk.php" >เดิน</a>
            <a href="calorie-menu/dance.php" >เต้น</a>
            <a href="calorie-menu/football.php" >ฟุตบอล</a>
        </div>
        </div>
        <a href="bmi.php">BMI</a>
        <a href="history.php">HISTORY</a>
    </div>
<?php
    if (isset($_SESSION['username'])) {
        $username = $_SESSION['username'];
        $query = "SELECT img FROM register WHERE username = '$username' ";
        $result = mysqli_query($conn, $query);
       if (mysqli_num_rows($result) == 1) {
           while($row = $result->fetch_assoc()) {
               $img = $row['img'];
           }
       } else {
           echo "0 results";
       }
       echo "<img src=img/$img width=50px height=50px id=nav-img>";
    ?>
    
    <div class="navbar">
    
            <a href="profile.php" id="nav-profile"><?php echo $_SESSION['username']; ?></a>
            <a href="index.php?logout='1'" id="nav-logout">LOGOUT</a>
        <?php } ?>
    </div>
    <h1>BMI</h1>
    <div class="bmi">
        <div class="calculat-bmi">
            <form method="POST">
                <label id="calculat">น้ำหนักตัว (kg.)<br>
                    <input type="number" id="weight" name="weight">
                </label><br>
                
                <label id="calculat">ส่วนสูง (cm.) <br>
                    <input type="number" id="height" name="height">
                </label><br>

                <input type="submit" name="sub-bmi" id="sub-bmi" value="คำนวณ">
            </form>
            <button id="output-bmi">
                <p id="ob">BMI</p>
                <label id="obmi">
                    <?php 
                    if(isset($_REQUEST['weight']) && isset($_REQUEST['height'])){
                        $weight = $_REQUEST['weight'];
                        $height = $_REQUEST['height'];
                        $bmi = $weight /(($height/100)*($height/100));
                        printf("%.2f",$bmi);
                    }
                
                    ?>
                </label>
            </button>
        </div>
        <div class="show-bmi">
            <table>
                <tr>
                    <th>BMI kg/m</th>
                    <th>อยู่ในเกณฑ์</th>
                    <th>ภาวะเสี่ยงต่อโรค</th>
                </tr>
                <?php
            if(isset($bmi)){
                if($bmi < 18.50){   
                ?>
                <tr>
                    <td>น้อยกว่า 18.50</td>
                    <td>น้ำหนักน้อย (ผอม)</td>
                    <td>มากกว่าคนปกติ</td>
                </tr> 
            </table>
            <div id="para">
            <h2>ข้อแนะนำ</h2>
            <p>1. ควรกินอาหารให้หลากหลายครบ 5 หมู่ในสัดส่วนที่เหมาะสมและปริมาณมากขึ้น โดยเพิ่มอาหารประเภทที่ให้พลังงานมากขึ้น เช่น ไขมัน แป้ง ข้าว เนื้อสัตว์ นม</p>
            <p>2. ควรเคลื่อนไหวและออกกำลังกายอย่างสม่ำเสมอทุกวันหรือเกือบทุกวัน ให้เหนื่อยพอควรโดยหายใจกระชั้นขึ้น เช่น เดินเร็ว ถีบจักรยาน รำมวยจีน ลีลาศจังหวะช้า 
                รวมทั้งงานบ้าน งานสวน เป็นต้น สะสมให้ได้อย่างน้อยวันละ 30 นาทีอาจไม่จำเป็นต้องออกกำลังกายให้เหนื่อยมากหรือหอบ ที่ง่ายที่สุดคือ การเดิน</p>
            </div>
            <?php }else
                if($bmi < 22.90){?>
                <tr>
                    <td>น้อยกว่า 22.90</td>
                    <td>ปกติ (สุขภาพดี)</td>
                    <td>เท่าคนปกติ</td>
                </tr> 
            </table>
            <div id="para">
            <h2>ข้อแนะนำ</h2>
            <P>1. ควรกินอาหารให้หลากหลายครบ 5 หมู่ในสัดส่วนที่เหมาะสม กินเท่าที่ร่างกายต้องการวันไหนกินมากเกินไป วันต่อมาก็กินลดลง กินอาหารพวกข้าวและแป้งรวมทั้งเมล็ดธัญพืชอื่น ๆ 
                ให้มากขึ้นไม่น้อยกว่าวันละ 6 ทัพพี กินผัก รวมทั้งเมล็ดถั่ว ผลไม้ ไม่ต่ำกว่าวันละ 5 ส่วน หรือครึ่งกิโลกรัม เพื่อไม่ให้มีพลังงานส่วนเกินจะทำให้ควบคุมน้ำหนักได้ดีและสมดุล</P>
            <P>2. ควรเคลื่อนไหวและออกกำลังกายอย่างสม่ำเสมอทุกวัน หรือเกือบทุกวัน อย่างน้อยให้เหนื่อยพอควร โดยหายใจกระชั้นขึ้น สะสมให้ได้อย่างน้อยวันละ 30 นาที 
                โดยอาจจะแบ่งเป็น 2 - 3 ครั้งก็ได้ จะเป็นกิจกรรมออกกำลังกายที่เป็นเรื่องเป็นราวหรือการออกแรงในกิจวัตรประจำวัน เช่นเดินเร็ว ถีบจักรยาน ลีลาศ หรืองานบ้าน งานสวน ให้เลือกทำตามใจชอบ 
                ถ้าคุณต้องการมีสมรรถภาพที่ดีก็ต้องออกกำลังกายแบบแอโรบิก เช่น เดินเร็ว ๆ วิ่งเหยาะ ถีบจักรยานเร็วๆ กระโดดเชือก ว่ายน้ำ เล่นกีฬา เป็นต้น ให้รู้สึกเหนื่อยมาก หรือหอบ อย่างน้อยวันละ 20 - 30 นาที 
                อย่างน้อยสัปดาห์ละ 3 วัน ที่ง่าย ที่สุดคือ การเดิน</P>
            </div>
            <?php }else
                if($bmi < 24.90){?>
                <tr>
                    <td>ระหว่าง 23 - 24.90</td>
                    <td>ท้วม (โรคอ้วนระดับ 1)</td>
                    <td>อันตรายระดับ 1</td>
                </tr> 
            </table>
            <div id="para">
            <h2>ข้อแนะนำ</h2>
            <p>1. ควรควบคุมอาหาร โดยลดปริมาณอาหารหรือปรับเปลี่ยนอาหารจากที่ให้พลังงานมากเป็นอาหารที่ให้พลังงานน้อย ทั้งนี้พลังงานที่ได้รับไม่ควรต่ำกว่า 1200 กิโลแคลอรีต่อวัน 
                โดยลดอาหารไขมัน/ เนื้อสัตว์ อาหารผัด/ทอด ขนมหวาน เครื่องดื่มที่ใส่น้ำตาล แอลกอฮอล์ แต่ต้องกินอาหารให้หลากหลายในสัดส่วนที่เหมาะสม กินข้าวและแป้ง 
                รวมทั้งเมล็ดธัญพืชอื่น ๆ ไม่น้อยกว่าวันละ 6 ทัพพี กินผัก รวมทั้งเมล็ดถั่ว ผลไม้ ไม่ต่ำกว่าวันละ 5 ส่วน หรือครึ่งกิโลกรัม เพื่อลดพลังงานเข้า ร่างกายจะได้ใช้พลังงานส่วนเกินที่สะสมอยู่ในรูปไขมันแทน</p>
            <p>2. ควรเคลื่อนไหวและออกกำลังกายแบบแอโรบิกอย่างสม่ำเสมอทุกวัน หรือเกือบทุกวันอย่างน้อยให้เหนื่อยพอควร โดยหายใจกระชั้นขึ้น สะสมอย่างน้อยวันละ 30 นาที อาจแบ่งเป็นวันละ 2 - 3 ครั้งก็ได้ 
                เช่น เดินเร็ว ถีบจักรยาน เป็นต้น หากยังไม่เคยออกกำลังกายเริ่มแรกควร ออกกำลังเบา ๆ ที่ง่ายที่สุดคือ การเดิน ใช้เวลาน้อย ๆ ก่อน จากนั้นค่อย ๆ เพิ่มเวลาขึ้นในแต่ละสัปดาห์ โดยยังไม่เพิ่มความหนัก 
                เมื่อร่างกายปรับตัวได้จึงค่อยเพิ่มความหนัก หรือความเหนื่อยตามที่ต้องการ และเพิ่มการเคลื่อนไหวร่างกายให้มากขึ้นในชีวิตประจำวัน เพื่อให้มีการใช้พลังงานเพิ่มขึ้น อย่างน้อยวันละ 200 - 300 กิโลแคลอรี</p>
            <p>3. ควรฝึกความแข็งแรงของกล้ามเนื้อ ด้วยการฝึกกายบริหารหรือยกน้ำหนัก จะช่วยเสริมให้ร่างกายมีการใช้พลังงานเพิ่มมากขึ้น ทำให้ไขมันลดลง</p>
            </div>
            <?php }else
                if($bmi < 29.90){?>
                <tr>
                    <td>ระหว่าง 25 - 29.90</td>
                    <td>อ้วน (โรคอ้วนระดับ 2)</td>
                    <td>อันตรายระดับ 2</td>
                </tr> 
            </table>
            <div id="para">
            <h2>ข้อแนะนำ</h2>
            <P>1. ควรควบคุมอาหารโดยลดปริมาณอาหารหรือปรับเปลี่ยนอาหารจากที่ให้พลังงานมากเป็นอาหารที่ให้พลังงานน้อย ทั้งนี้พลังงานที่ได้รับไม่ควรต่ำกว่า 1200 กิโลแคลอรีต่อวัน 
                โดยลดอาหารไขมัน/เนื้อสัตว์ อาหารผัด/ทอด ขนมหวาน เครื่องดื่มที่ใส่น้ำตาล แอลกอฮอล์ แต่ต้องกินอาหารให้หลากหลายในสัดส่วนที่เหมาะสม 
                กินข้าวและแป้งรวมทั้งเมล็ดธัญพืชอื่น ๆ ไม่น้อยกว่าวันละ 6 ทัพพี กินผักรวมทั้งเมล็ดถั่ว ผลไม้ไม่ต่ำกว่าวันละ 5 ส่วน หรือครึ่งกิโลกรัมเพื่อลดพลังงานเข้า ร่างกายจะได้ใช้พลังงานส่วนเกินที่สะสมอยู่ในรูปไขมันแทน</P>
            <P>2. ควรเคลื่อนไหวและออกกำลังกายแบบแอโรบิกอย่างสม่ำเสมอทุกวันหรือเกือบทุกวันอย่างน้อยให้เหนื่อยพอควรโดยหายใจกระชั้นขึ้น ประมาณ 40-60 นาทีต่อวัน หรือแบ่งเป็นวันละ 2 ครั้ง ๆ ละ 20 - 30 นาที
                เช่น เดินเร็ว ถีบจักรยาน เป็นต้น หากยังไม่เคยออกกำลังกายเริ่มแรก ควรออกกำลังเบา ๆ ที่ง่ายที่สุดคือ การเดิน ใช้เวลาน้อยๆ ก่อน จากนั้น ค่อย ๆ เพิ่มเวลาขึ้นในแต่ละสัปดาห์ โดยยังไม่เพิ่มความหนัก 
                เมื่อร่างกายปรับตัวได้จึงค่อยเพิ่มความหนัก หรือความเหนื่อยตามที่ต้องการและเพิ่มการเคลื่อนไหวร่างกายให้มากขึ้นในชีวิตประจำวัน เพื่อให้มีการใช้พลังงานเพิ่มขึ้น อย่างน้อยวันละ 200 - 300 กิโลแคลอรี</P>
            <P>3. ควรฝึกความแข็งแรงของกล้ามเนื้อ ด้วยการฝึกกายบริหารหรือยกน้ำหนัก จะช่วยเสริมให้ร่างกายมีการใช้พลังงานเพิ่มมากขึ้น ทำให้ไขมันลดลง</P>
            <P>4. ถ้าคุณสามารถลดพลังงานเข้าจากอาหารลงได้วันละ 400 กิโลแคลอรี และเพิ่มการใช้ พลังงานจากการออกกำลังกายวันละ 200 กิโลแคลอรี รวมแล้วคุณมีพลังงาพร่องลงไปวันละ 600 กิโลแคลอรี 
                ออกกำลังกายประมาณ 6 วัน คิดเป็นพลังงานพร่อง 3600 กิโลแคลอรี คุณจะลดไขมันลงได้ประมาณครึ่งกิโลกรัมต่อสัปดาห์ พลังงานเข้าหรือออก 3500 กิโลแคลอรี จะเพิ่มหรือลดไขมันได้ 1 ปอนด์ หรือ 0.45 กิโลกรัม</P>
            <P>5. ควรปรึกษาแพทย์หรือผู้เชี่ยวชาญในการลดและควบคุมน้ำหนัก</P>
            </div>
            <?php }
                else{?>
                <tr>
                    <td>ระหว่าง 25 - 29.90</td>
                    <td>อ้วนมาก (โรคอ้วนระดับ 3)</td>
                    <td>อันตรายระดับ 3</td>
                </tr> 
            </table>
            <div id="para">
            <h2>ข้อแนะนำ</h2>
            <P>1. ควรควบคุมอาหารโดยลดปริมาณอาหารหรือปรับเปลี่ยนอาหารจากที่ให้พลังงานมากเป็นอาหารที่ให้พลังงานน้อย ทั้งนี้พลังงานที่ได้รับไม่ควรต่ำกว่า 1200 กิโลแคลอรีต่อวัน 
                โดยลดอาหารไขมัน/เนื้อสัตว์ อาหารผัด/ทอด ขนมหวาน เครื่องดื่มที่ใส่น้ำตาล แอลกอฮอล์ แต่ต้องกินอาหารให้หลากหลายในสัดส่วนที่เหมาะสม 
                กินข้าวและแป้งรวมทั้งเมล็ดธัญพืชอื่น ๆ ไม่น้อยกว่าวันละ 6 ทัพพี กินผักรวมทั้งเมล็ดถั่ว ผลไม้ไม่ต่ำกว่าวันละ 5 ส่วน หรือครึ่งกิโลกรัมเพื่อลดพลังงานเข้า ร่างกายจะได้ใช้พลังงานส่วนเกินที่สะสมอยู่ในรูปไขมันแทน</P>
            <P>2. ควรเคลื่อนไหวและออกกำลังกายแบบแอโรบิกอย่างสม่ำเสมอทุกวันหรือเกือบทุกวันอย่างน้อยให้เหนื่อยพอควรโดยหายใจกระชั้นขึ้น ประมาณ 40-60 นาทีต่อวัน หรือแบ่งเป็นวันละ 2 ครั้ง ๆ ละ 20 - 30 นาที
                เช่น เดินเร็ว ถีบจักรยาน เป็นต้น หากยังไม่เคยออกกำลังกายเริ่มแรก ควรออกกำลังเบา ๆ ที่ง่ายที่สุดคือ การเดิน ใช้เวลาน้อยๆ ก่อน จากนั้น ค่อย ๆ เพิ่มเวลาขึ้นในแต่ละสัปดาห์ โดยยังไม่เพิ่มความหนัก 
                เมื่อร่างกายปรับตัวได้จึงค่อยเพิ่มความหนัก หรือความเหนื่อยตามที่ต้องการและเพิ่มการเคลื่อนไหวร่างกายให้มากขึ้นในชีวิตประจำวัน เพื่อให้มีการใช้พลังงานเพิ่มขึ้น อย่างน้อยวันละ 200 - 300 กิโลแคลอรี</P>
            <P>3. ควรฝึกความแข็งแรงของกล้ามเนื้อ ด้วยการฝึกกายบริหารหรือยกน้ำหนัก จะช่วยเสริมให้ร่างกายมีการใช้พลังงานเพิ่มมากขึ้น ทำให้ไขมันลดลง</P>
            <P>4. ถ้าคุณสามารถลดพลังงานเข้าจากอาหารลงได้วันละ 400 กิโลแคลอรี และเพิ่มการใช้ พลังงานจากการออกกำลังกายวันละ 200 กิโลแคลอรี รวมแล้วคุณมีพลังงาพร่องลงไปวันละ 600 กิโลแคลอรี 
                ออกกำลังกายประมาณ 6 วัน คิดเป็นพลังงานพร่อง 3600 กิโลแคลอรี คุณจะลดไขมันลงได้ประมาณครึ่งกิโลกรัมต่อสัปดาห์ พลังงานเข้าหรือออก 3500 กิโลแคลอรี จะเพิ่มหรือลดไขมันได้ 1 ปอนด์ หรือ 0.45 กิโลกรัม</P>
            <P>5. ควรปรึกษาแพทย์หรือผู้เชี่ยวชาญในการลดและควบคุมน้ำหนัก</P>
            </div>

            <?php 
                }
            } 
        ?>
        </div>
    </div>
    <a href="index.php" id="aback">กลับ</a>
</body>
</html>